fufilius/esp32-IPphone/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_FREERTOS_HZ=1000

# PTT-compatible hardware defaults.
CONFIG_IPPHONE_BUTTON_GPIO=25
CONFIG_IPPHONE_BUTTON_ACTIVE_LEVEL=0
CONFIG_IPPHONE_BUTTON_DEBOUNCE_MS=40
CONFIG_IPPHONE_BUTTON_HOLD_MS=500

CONFIG_IPPHONE_I2S_MIC_BCLK=18
CONFIG_IPPHONE_I2S_MIC_WS=19
CONFIG_IPPHONE_I2S_MIC_DIN=23
CONFIG_IPPHONE_I2S_SPK_BCLK=5
CONFIG_IPPHONE_I2S_SPK_WS=17
CONFIG_IPPHONE_I2S_SPK_DOUT=22
CONFIG_IPPHONE_I2S_SAMPLE_RATE=8000

CONFIG_IPPHONE_I2C_SDA=21
CONFIG_IPPHONE_I2C_SCL=4

CONFIG_IPPHONE_LED_GREEN_GPIO=2
CONFIG_IPPHONE_LED_GREEN_ACTIVE_LEVEL=1
CONFIG_IPPHONE_LED_RED_GPIO=16
CONFIG_IPPHONE_LED_RED_ACTIVE_LEVEL=1

CONFIG_IPPHONE_WIFI_SSID=""
CONFIG_IPPHONE_WIFI_PASSWORD=""
CONFIG_IPPHONE_WIFI_HOSTNAME="esp32-ipphone"
CONFIG_IPPHONE_WIFI_MAX_RETRY=8
CONFIG_IPPHONE_WIFI_CONNECT_TIMEOUT_MS=20000

CONFIG_IPPHONE_SIP_SERVER=""
CONFIG_IPPHONE_SIP_PORT=5060
CONFIG_IPPHONE_SIP_USER=""
CONFIG_IPPHONE_SIP_PASSWORD=""
CONFIG_IPPHONE_SIP_DEFAULT_EXTENSION="1002"

CONFIG_IPPHONE_SD_SCK_GPIO=14
CONFIG_IPPHONE_SD_MOSI_GPIO=13
CONFIG_IPPHONE_SD_MISO_GPIO=27
CONFIG_IPPHONE_SD_CS_GPIO=32
CONFIG_IPPHONE_SD_SPI_FREQ_KHZ=400
